Repository: rcrossa/automate-dashboard
Catalog: app/lib/l10n/app_*.arb
Languages: es

# appTitle
source: My First App
es: Mi Primera App

# loginTitle
source: Login
es: Iniciar Sesión

# emailLabel
source: Email
es: Correo Electrónico

# passwordLabel
source: Password
es: Contraseña

# loginButton
source: Sign In
es: Ingresar

# registerButton
source: Register
es: Registrarse

# registerTitle
source: Register
es: Registro

# nameLabel
source: Name
es: Nombre

# welcomeMessage
source: Welcome
es: Bienvenido

source: Forgot password?
es: ¿Olvidaste tu contraseña?

source: Logout
es: Cerrar Sesión

source: Close
es: Cerrar

source: Cancel
es: Cancelar

# roleDetected
source: Role detected: {role}
es: Rol detectado: {role}

source: None
es: Ninguno

source: Debug Mode
es: Modo Debug

# debugAdminMessage
source: To see the Admin Dashboard, your user must have the "admin" role in the database. Do you want to simulate being Admin now?
es: Para ver el Dashboard de Admin, tu usuario debe tener el rol "admin" en la base de datos. ¿Quieres simular ser Admin ahora?

source: Simulate (Not implemented)
es: Simular (No implementado)

# assignRoleMessage
source: Please assign the "admin" role in Supabase or use an admin user.
es: Por favor, asigna el rol "admin" en Supabase o usa un usuario admin.

# whySeeThis
source: Why am I seeing this?
es: ¿Por qué veo esto?

source: Permissions:
es: Permisos:

# companyLabelWithVal
source: Company: {company}
es: Empresa: {company}

# branchLabelWithVal
source: Branch: {branch}
es: Sucursal: {branch}

source: No company assigned.
es: No tienes empresa asignada.

source: Dashboard Inactive
es: Dashboard Inactivo

# dashboardDisabledMessage
source: The Dashboard module is disabled.
es: El módulo Dashboard está desactivado.

# adminActivateMessage
source: As an administrator, you can activate it in the Marketplace.
es: Como administrador, puedes activarlo en el Marketplace.

source: Go to Marketplace
es: Ir al Marketplace

source: Access Denied
es: Acceso Denegado

source: Dashboard not active
es: Dashboard no activo

# contactAdminMessage
source: Contact your administrator to activate this module.
es: Contacte a su administrador para activar este módulo.

# userNotFoundDB
source: User not found in database.
es: No se encontró el usuario en la base de datos.

source: Authenticated User ID
es: ID de usuario autenticado

source: View User ID
es: Ver ID de usuario

source: Company Panel
es: Panel de Empresa

source: Modules Marketplace
es: Marketplace de Módulos

source: Summary
es: Resumen

source: Branches
es: Sucursales

source: Personnel
es: Personal

source: Search Branch
es: Buscar Sucursal

source: No branches found
es: No se encontraron sucursales

source: No address
es: Sin dirección

source: Edit Branch
es: Editar Sucursal

source: New Branch
es: Nueva Sucursal

source: Branch updated
es: Sucursal actualizada

source: Branch created
es: Sucursal creada

# addressLabel
source: Address
es: Dirección

source: Save
es: Guardar

source: Create
es: Crear

# audioTestTitle
source: Audio Recording Test
es: Test de Grabación de Audio

# audioTestSubtitle
source: Test recording and transcription functionality
es: Prueba funcionalidad de grabación y transcripción

# toolsSection
source: Testing Tools
es: Herramientas de Testing

# audioTestCard
source: Audio Test
es: Test de Audio

# audioTestDescription
source: Test voice recording and speech-to-text transcription
es: Prueba grabación y transcripción de voz a texto

# branchInfoSection
source: Information
es: Información

source: Current Branch
es: Sucursal Actual

# branchName
source: Name
es: Nombre

# branchAddress
source: Address
es: Dirección

# limitedAccessStaff
source: Limited access: staff view
es: Acceso limitado: vista de staff

# recordingInstructions
source: Tap the microphone to start recording
es: Toca el micrófono para comenzar a grabar

source: Tap to record
es: Toca para grabar

source: RECORDING
es: GRABANDO

source: PAUSED
es: PAUSADO

# maxDuration
source: Maximum: {duration}
es: Máximo: {duration}

# recordingControls
source: Controls
es: Controles

# cancelRecording
source: Cancel
es: Cancelar

# pauseRecording
source: Pause
es: Pausar

# resumeRecording
source: Resume
es: Resumir

# stopRecording
source: Finish
es: Finalizar

source: Permission Required
es: Permiso Requerido

# microphonePermissionMessage
source: Microphone access is needed to record audio. Please enable the permission in app settings.
es: Se necesita acceso al micrófono para grabar audio. Por favor, habilita el permiso en la configuración de la app.

# errorStartingRecording
source: Error starting recording: {error}
es: Error al iniciar grabación: {error}

source: Recorded Audio
es: Audio Grabado

# fileName
source: File
es: Archivo

# fileSize
source: Size
es: Tamaño

source: No recordings yet
es: Sin grabaciones aún

source: Transcribe Audio
es: Transcribir Audio

source: Transcribing...
es: Transcribiendo...

source: Transcription
es: Transcripción

# copyToClipboard
source: Copy
es: Copiar

source: Copied to clipboard
es: Copiado al portapapeles

# transcriptionCompleted
source: Transcription completed âœ…
es: Transcripción completada ✅

# textCopied
source: Text copied to clipboard
es: Texto copiado al portapapeles

source: Recording Test
es: Test de Grabación

source: Transcription error
es: Error en transcripción

# backendConnectionError
source: Cannot connect to server. Verify that the backend is running.
es: No se puede conectar al servidor. Verifica que el backend esté ejecutándose.

# transcriptionFailed
source: Transcription failed: {error}
es: Error al transcribir: {error}

source: Search Personnel
es: Buscar Personal

source: No employees found
es: No se encontraron empleados

source: No name
es: Sin nombre

# roleBranchLabel
source: Role: {role} - Branch: {branch}
es: Rol: {role} - Sucursal: {branch}

# matrix
source: HQ
es: Matriz

source: Edit Personnel
es: Editar Personal

source: Invite Personnel
es: Invitar Personal

# lastNameLabel
source: Last Name
es: Apellido

# docIdLabel
source: Document ID
es: Documento Identidad

# phoneLabel
source: Phone
es: Teléfono

# roleLabel
source: Role
es: Rol

# adminRole
source: Administrator
es: Administrador

# managerRole
source: Manager
es: Gerente

# userRole
source: User / Staff
es: Usuario / Staff

# branchOptionalLabel
source: Branch (Optional)
es: Sucursal (Opcional)

# noBranchMatrixLabel
source: No Branch (HQ)
es: Sin Sucursal (Casa Matriz)

source: Invite
es: Invitar

source: User updated
es: Usuario actualizado

source: Invitation sent
es: Invitación enviada

source: General Summary
es: Resumen General

source: Income (Month)
es: Ingresos (Mes)

source: Claims
es: Reclamos

source: Income by Branch
es: Ingresos por Sucursal

source: Branch Panel
es: Panel de Sucursal

# branchLabel
source: Branch: {name}
es: Sucursal: {name}

source: Branch Management Panel
es: Panel de Gestión de Sucursal

source: View Claims
es: Ver Reclamos

source: View Interactions
es: Ver Interacciones

# staffPortalTitle
source: {name} - Staff Portal
es: {name} - Portal Staff

# welcomeStaffPortal
source: Welcome to Staff Portal
es: Bienvenido al Portal de Staff

# staffPortalSubtitle
source: Manage your tasks and clock-ins from here.
es: Gestiona tus tareas y fichajes desde aquí.

source: Clock In
es: Fichar

source: My Tasks
es: Mis Tareas

source: Requests
es: Solicitudes

source: My Profile
es: Mi Perfil

source: Recent Activity
es: Actividad Reciente

# searchUserPlaceholder
source: Name or email
es: Nombre o email

# userCount
source: {count} users
es: {count} usuarios

# paginationInfo
source: Page {current} of {total}
es: Página {current} de {total}

source: No results
es: Sin resultados

# clientFileTitle
source: Client File
es: Ficha de Cliente

source: Interaction History
es: Historial de Interacciones

source: Reload
es: Recargar

# noInteractions
source: No interactions registered
es: No hay interacciones registradas

source: Add Note
es: Agregar Nota

# notePlaceholder
source: Write a note about the client...
es: Escribe una nota sobre el cliente...

# errorLoadingInteractions
source: Error loading interactions: {error}
es: Error al cargar interacciones: {error}

# errorSavingNote
source: Error saving note: {error}
es: Error al guardar nota: {error}

# claimsTitle
source: Claims: {name}
es: Reclamos: {name}

# noClaims
source: No claims registered
es: No hay reclamos registrados

source: New Claim
es: Nuevo Reclamo

# titleLabel
source: Title
es: Título

# descriptionLabel
source: Description
es: Descripción

# priorityLabel
source: Priority
es: Prioridad

# priorityLow
source: Low
es: Baja

# priorityMedium
source: Medium
es: Media

# priorityHigh
source: High
es: Alta

# errorLoadingClaims
source: Error loading claims: {error}
es: Error al cargar reclamos: {error}

# errorCreatingClaim
source: Error creating claim: {error}
es: Error al crear reclamo: {error}

source: Error updating client
es: Error al actualizar cliente

# branchManagementTitle
source: Branch Management
es: Gestión de Sucursales

# personnelManagementTitle
source: Personnel Management
es: Gestión de Personal

# errorNoCompanyContext
source: Error: No company found in context
es: Error: No se encontró empresa en el contexto

source: No branches registered
es: No hay sucursales registradas

source: No employeesRegistered
es: No hay empleados registrados

# clientFormTitleNew
source: New Client
es: Nuevo Cliente

# clientFormTitleEdit
source: Edit Client
es: Editar Cliente

# labelBranch
source: Branch
es: Sucursal

# labelHeadquarters
source: Headquarters / Global
es: Casa Matriz / Global

# typePerson
source: Person
es: Persona

# typeCompany
source: Company
es: Empresa

# labelBusinessName
source: Business Name *
es: Razón Social *

# labelTaxId
source: Tax ID *
es: CUIT *

# labelContactName
source: Contact Name *
es: Nombre Contacto *

# labelContactLastName
source: Contact Last Name
es: Apellido Contacto

# labelName
source: Name *
es: Nombre *

# labelLastName
source: Last Name
es: Apellido

# labelIdDocument
source: ID Document
es: DNI / Documento

# labelPhone
source: Phone
es: Teléfono

# labelAddress
source: Address
es: Dirección

# labelNotes
source: Notes
es: Notas

# btnCancel
source: Cancel
es: Cancelar

# btnSave
source: Save
es: Guardar

# validationRequired
source: Required
es: Requerido

# marketplaceTitle
source: Module Marketplace
es: Marketplace de Módulos

# errorUpdatingStatus
source: Error updating status: {error}
es: Error al actualizar estado: {error}

source: View File
es: Ver Ficha

# permissionsLabel
source: Permissions:
es: Permisos:

# statusPending
source: Pending
es: Pendiente

# statusInProgress
source: In Progress
es: En Proceso

# statusResolved
source: Resolved
es: Resuelto

# statusClosed
source: Closed
es: Cerrado

# priorityDisplay
source: Priority: {priority}
es: Prioridad: {priority}

# serverError
source: Server error. Please try again later.
es: Error en el servidor. Por favor, intente más tarde.

# authError
source: Authentication error.
es: Error de autenticación.

# networkError
source: Connection error. Check your internet.
es: Error de conexión. Verifique su internet.

# validationError
source: Validation error. Check your data.
es: Error de validación. Verifique los datos.

# unknownError
source: An unexpected error occurred.
es: Ha ocurrido un error inesperado.

# superAdminDashboardTitle
source: Super Admin Dashboard
es: Panel de Super Admin

# companiesSection
source: Companies
es: Empresas

# pendingInvitationsSection
source: Pending Invitations
es: Invitaciones Pendientes

source: No pending invitations
es: No hay invitaciones pendientes

# errorLoadingCompanies
source: Error loading companies: {error}
es: Error cargando empresas: {error}

# codeLabel
source: Code
es: Código

# createdLabel
source: Created
es: Creada

# manageModulesTooltip
source: Manage Modules
es: Gestionar Módulos

# manageCompanyTooltip
source: Manage Company
es: Gestionar Empresa

# drawerHome
source: Home
es: Inicio

# drawerAdmin
source: Admin / Management
es: Admin / Gerencia

# drawerLogout
source: Logout
es: Cerrar Sesión

# drawerLanguage
source: Language / Idioma
es: Idioma / Language

# loginLabel
source: Username or Email
es: Usuario o Email

# usernameLabel
source: Username
es: Usuario

source: Edit Profile
es: Editar Perfil

source: Profile updated
es: Perfil actualizado

# usernameFieldLabel
source: Username
es: Nombre de Usuario

source: Clients
es: Clientes

source: User not found
es: Usuario no encontrado

# userFetchError
source: Could not fetch user.
es: No se pudo obtener el usuario.

# loginSuccess
source: Login successful!
es: ¡Login exitoso!

# loginError
source: Incorrect credentials or unknown error.
es: Credenciales incorrectas o error desconocido.

# registerSuccess
source: Registration successful! Check your email to confirm.
es: ¡Registro exitoso! Revisa tu email para confirmar.

# registerError
source: Could not register. Check data or email.
es: No se pudo registrar. Verifica los datos o tu email.

# recoveryEmailInvalid
source: Enter a valid email to recover password.
es: Ingresa un email válido para recuperar la contraseña.

source: Recovery email sent!
es: ¡Email de recuperación enviado!

# badCredentials
source: Incorrect email or password.
es: Email o contraseña incorrectos.

# claimsManagementTitle
source: Claims Management
es: Gestión de Reclamos

# searchClaimsPlaceholder
source: Search (ID, Title, Desc...)
es: Buscar (ID, Titulo, Desc...)

source: All Statuses
es: Todos los Estados

source: All Branches
es: Todas las Sucursales

source: Items per page:
es: Items por pág:

# crmConfig
source: CRM Configuration
es: Configuración CRM

# noClientAssigned
source: No Client
es: Sin Cliente

source: Loading...
es: Cargando...

source: No claims found
es: No se encontraron reclamos

source: Import Clients
es: Importar Clientes

source: Pick File (CSV)
es: Seleccionar Archivo (CSV)

source: Preview
es: Vista Previa

# importBtn
source: Import
es: Importar

# importSuccess
source: Import successful: {count} clients
es: Importación exitosa: {count} clientes

# importError
source: Error importing: {error}
es: Error al importar: {error}

# rowsFound
source: {count} rows found
es: {count} filas encontradas

source: No clients to export.
es: No hay clientes para exportar.

# exportSuccess
source: Successfully exported to: {path}
es: Exportado exitosamente a: {path}

# exportError
source: Export error: {error}
es: Error al exportar: {error}

# companyCreatedSuccess
source: Company created successfully
es: Empresa creada exitosamente

# companyCodeExists
source: Company code already exists.
es: El código de empresa ya existe.

# companyCreationError
source: Error creating company: {error}
es: Error al crear empresa: {error}

# invitationDeleteSuccess
source: Invitation deleted successfully
es: Invitación eliminada exitosamente

# invitationDeleteError
source: Error deleting invitation: {error}
es: Error al eliminar invitación: {error}

# clientUpdateError
source: Error updating data: {error}
es: Error actualizando datos: {error}

# clientDeleteError
source: Error deleting: {error}
es: Error al eliminar: {error}

# claimDeleteSuccess
source: Claim deleted
es: Reclamo eliminado

# configurationError
source: Configuration error: {error}
es: Error en configuración: {error}

# clientImportError
source: Import error: {error}
es: Error al importar: {error}

# brandingCustomization
source: Brand Customization
es: Personalización de Marca

# brandingLoading
source: Loading...
es: Cargando...

# brandingNotFound
source: Branding configuration not found
es: No se encontró configuración de branding

# brandingTabColorsBase
source: Base Colors
es: Colores Base

# brandingTabColorsAdditional
source: Additional Colors
es: Colores Adicionales

# brandingTabTypography
source: Typography
es: Tipografía

# brandingTabAdvanced
source: Advanced
es: Avanzado

# brandingLogosTitle
source: Company Logos
es: Logos de Empresa

# brandingLogosSubtitle
source: Upload your company logos to customize the app
es: Sube los logos de tu empresa para personalizar la app

# brandingLogoPrimary
source: Primary Logo
es: Logo Principal

# brandingLogoPrimarySubtitle
source: Shown in light theme
es: Se muestra en el tema claro

# brandingLogoLight
source: Light Logo
es: Logo Claro

# brandingLogoLightSubtitle
source: Shown in dark mode
es: Se muestra en el modo oscuro

# brandingColorsBaseTitle
source: Base Colors
es: Colores Base

# brandingColorsBaseSubtitle
source: Define your brand's main colors
es: Define los colores principales de tu marca

# brandingColorPrimary
source: Primary Color
es: Color Primario

# brandingColorSecondary
source: Secondary Color
es: Color Secundario

# brandingColorAccent
source: Accent Color
es: Color de Acento

# brandingColorPrimaryDark
source: Primary (Dark)
es: Primario (Dark)

# brandingColorSecondaryDark
source: Secondary (Dark)
es: Secundario (Dark)

# brandingColorsAdditionalTitle
source: Additional Colors
es: Colores Adicionales

# brandingColorsAdditionalSubtitle
source: Customize background, text and state colors
es: Personaliza colores de fondo, texto y estados

# brandingColorsGeneral
source: General Colors
es: Colores Generales

# brandingColorsStates
source: State Colors
es: Colores de Estado

# brandingColorBackground
source: Background
es: Fondo

# brandingColorText
source: Text
es: Texto

# brandingColorSuccess
source: Success
es: Éxito

# brandingColorWarning
source: Warning
es: Advertencia

# brandingColorInfo
source: Information
es: Información

# brandingColorBackgroundDark
source: Background (Dark)
es: Fondo (Dark)

# brandingColorTextDark
source: Text (Dark)
es: Texto (Dark)

# brandingColorSuccessDark
source: Success (Dark)
es: Éxito (Dark)

# brandingColorWarningDark
source: Warning (Dark)
es: Advertencia (Dark)

# brandingColorInfoDark
source: Information (Dark)
es: Información (Dark)

# brandingTypographyTitle
source: Typography
es: Tipografía

# brandingTypographySubtitle
source: Select fonts and text sizes
es: Selecciona las fuentes y tamaños de texto

# brandingFonts
source: Fonts
es: Fuentes

# brandingFontPrimary
source: Primary Font
es: Fuente Primaria

# brandingFontSecondary
source: Secondary Font (Headers)
es: Fuente Secundaria (Headers)

# brandingSizes
source: Sizes
es: Tamaños

# brandingTextSizeBase
source: Base Text Size: {size}px
es: Tamaño de Texto Base: {size}px

# brandingTextSizeHeader
source: Header Size: {size}px
es: Tamaño de Headers: {size}px

# brandingTextSizeExample
source: Example text with {size}px size
es: Texto de ejemplo con tamaño {size}px

# brandingHeaderExample
source: Example Title
es: Título Ejemplo

# brandingAdvancedTitle
source: Advanced Options
es: Opciones Avanzadas

# brandingAdvancedSubtitle
source: Predefined presets and advanced options
es: Presets predefinidos y opciones avanzadas

# brandingPresets
source: Theme Presets
es: Presets de Tema

# brandingPresetsSubtitle
source: Apply a predefined preset to quickly configure colors
es: Aplica un preset predefinido para configurar rápidamente los colores

# brandingPresetNone
source: None
es: Ninguno

# brandingPresetSelect
source: Select Preset
es: Seleccionar Preset

# brandingResetDefaults
source: Reset to Defaults
es: Restaurar a Defaults

# brandingInfo
source: Information
es: Información

# brandingLastUpdated
source: Last updated: {date}
es: Última actualización: {date}

# brandingCreated
source: Created: {date}
es: Creado: {date}

# brandingPresetApplied
source: Preset "{name}" applied
es: Preset "{name}" aplicado

# brandingResetDialogTitle
source: Reset Defaults
es: Restaurar Defaults

# brandingResetDialogMessage
source: Are you sure you want to reset all values to defaults?
es: ¿Estás seguro de que quieres restaurar todos los valores a los defaults?

# brandingResetDialogConfirm
source: Reset
es: Restaurar

# brandingSelectColor
source: Select Color
es: Seleccionar Color

# brandingSelectColorButton
source: Select
es: Seleccionar

# brandingSaveChanges
source: Save Changes
es: Guardar Cambios

# brandingSaveSuccess
source: Branding updated successfully
es: Branding actualizado exitosamente

# brandingSaveError
source: Error saving: {error}
es: Error al guardar: {error}

# logoDeleteSuccess
source: Logo deleted successfully
es: Logo eliminado correctamente
